GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/camera.c
					/*
					   pack_head.Time.years=0x13;
					   pack_head.Time.months=0x06;
					   pack_head.Time.days=tick>>24;
					   pack_head.Time.hours=tick>>16;
					   pack_head.Time.minutes=tick>>8;
					   pack_head.Time.seconds=tick;
					 */
					memcpy( &pack_head.position, &gps_baseinfo, 28 );
					pack_head.State = 0xFF;
					if( Current_Cam_Para.Para.SavePhoto == 0 )
					{
						pack_head.State &= ~( BIT( 2 ) );
					}
				}
				///最后一包数据，需要将长度写入。
				if( cam_last_page )
				{
					pack_head.Len			= cam_photo_size + 64;
					Current_Cam_Para.State	= CAM_OK;
				}else
				{
					Current_Cam_Para.State = CAM_GET_PHOTO;
				}
				///保存数据
				Cam_Flash_WrPic( uart2_rx, uart2_rx_wr, &pack_head );
				Hex_To_Ascii( uart2_rx, CamTestBuf, uart2_rx_wr );
				rt_kprintf( "\r\n拍照数据:\r\n" );
				rt_kprintf( "%s\r\n", CamTestBuf );
				rt_kprintf( "\r\n%d>CAM%d photo %d bytes", rt_tick_get( ) * 10, Current_Cam_Para.Para.Channel_ID, cam_photo_size );
				uart2_rx_wr = 0;
			}else if( rt_tick_get( ) - tick > RT_TICK_PER_SECOND * 2 ) ///判读是否超时
			{
				Current_Cam_Para.State = CAM_START;
			}
			break;
		}
		case CAM_OK:
		{
			++Current_Cam_Para.Para.PhotoNum;
			if( Current_Cam_Para.Para.cb_response_cam_ok != RT_NULL ) ///调用单张照片拍照成功回调函数
			{
				Current_Cam_Para.Para.cb_response_cam_ok( &Current_Cam_Para.Para, pack_head.Data_ID );
			}else ///默认的回调函数
			{
				Cam_response_ok( &Current_Cam_Para.Para, pack_head.Data_ID );
			}

			rt_kprintf( "\r\n拍照成功!" );
			getpicpara( );
			if( Current_Cam_Para.Para.PhotoNum >= Current_Cam_Para.Para.PhotoTotal )
			{
				Current_Cam_Para.State = CAM_END;   ///拍照任务完成
			}else
			{
				Current_Cam_Para.State = CAM_IDLE;  ///单张照片拍照完成
			}
			break;
		}
		case CAM_FALSE:
		{
			rt_kprintf( "\r\n拍照失败!" );
			Current_Cam_Para.State = CAM_END;
		}
		case CAM_END:
		{
			rt_kprintf( "\r\n拍照结束!" );
			Current_Cam_Para.State = CAM_NONE;
			if( Current_Cam_Para.Para.cb_response_cam_end != RT_NULL ) ///调用单张照片拍照成功回调函数
			{
				Current_Cam_Para.Para.cb_response_cam_end( &Current_Cam_Para.Para );
				rt_free( Current_Cam_Para.Para.user_para );
				rt_kprintf( "\r\nCam_jt808_0x8801_cam_end_free" );
			}else ///默认的回调函数
			{
				Cam_response_end( &Current_Cam_Para.Para );
			}
			break;
		}
		default:
		{
			Current_Cam_Para.State = CAM_NONE;
		}
	}
	return 1;
}

/*********************************************************************************
  *函数名称:void Cam_takepic_ex(u16 id,u16 num,u16 space,u8 send,Style_Cam_Requset_Para trige)
  *功能描述:	拍照请求函数，
  *输	入:	id		:照相机ID范围为1-15
   num		:拍照数量
   space	:拍照间隔，单位为秒
   save	:是否保存图片到FLASH中
   send	:拍完后是否上传，1表示上传
   trige	:拍照触发源类型为	Style_Cam_Requset_Para
  *输	出:	none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-06-21
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void Cam_takepic_ex( u16 id, u16 num, u16 space, u8 save, u8 send, Cam_Trigger trige )
{
	Style_Cam_Requset_Para tempPara;
	if( trige > Cam_TRIGGER_OTHER )
	{
		trige = Cam_TRIGGER_OTHER;
	}
	memset( &tempPara, 0, sizeof( tempPara ) );
	tempPara.Channel_ID		= id;
	tempPara.PhoteSpace		= space * RT_TICK_PER_SECOND;
	tempPara.PhotoTotal		= num;
	tempPara.SavePhoto		= save;
	tempPara.SendPhoto		= send;
	tempPara.TiggerStyle	= trige;
	take_pic_request( &tempPara );
	rt_kprintf( "\r\n请求拍照ID=%d", id );
}

FINSH_FUNCTION_EXPORT( Cam_takepic_ex, para_id_num_space_save_send_trige );


/*********************************************************************************
  *函数名称:void Cam_takepic(u16 id,u8 send,Style_Cam_Requset_Para trige)
  *功能描述:	拍照请求函数，
  *输	入:	id		:照相机ID范围为1-15
   save	:是否保存图片到FLASH中
   send	:拍完后是否上传，1表示上传
   trige	:拍照触发源类型为	Style_Cam_Requset_Para
  *输	出:	none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-06-21
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void Cam_takepic( u16 id, u8 save, u8 send, Cam_Trigger trige )
{
	Cam_takepic_ex( id, 1, 0, save, send, trige );
}

FINSH_FUNCTION_EXPORT( Cam_takepic, para_id_save_send_trige );


/*********************************************************************************
  *函数名称:void Cam_get_All_pic(void)
  *功能描述:	获取图片数据，打印到调试串口
  *输	入:	none
  *输	出:	none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-06-21
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void Cam_get_All_pic( void )
{
	Cam_Flash_InitPara( 1 );
}

FINSH_FUNCTION_EXPORT( Cam_get_All_pic, Cam_get_All_pic );

#define CAM_START	0x40000
#define CAM_SECTORS 200
#define CAM_END		( CAM_START + CAM_SECTORS * 4096 )

TypeDF_PackageInfo picinfo_curr = { CAM_START, 0, 0 };

typedef uint8_t ( *VisitFunc )( uint32_t addr, TypeDF_PackageHead *phead,void *ctx );


/*查找最近的图片*/
uint8_t cb_pic_init( uint32_t addr, TypeDF_PackageHead *phead,void *data)
{
	if(phead->Data_ID>picinfo_curr.Data_ID)		/*查找最大*/
	{
		picinfo_curr.Address	= addr;
		picinfo_curr.Len		= phead->Len;
		picinfo_curr.Data_ID	= phead->Data_ID;
	}	
	return 0;	/*继续查找*/
}

/*查找指定ID的图片*/
uint8_t cb_pic_findid( uint32_t addr, TypeDF_PackageHead * phead,void *data )
{
	if(phead->Data_ID==*(u32*)data)
	{
		rt_kprintf("find %d (%08x)\r\n",phead->Data_ID,addr);
		return 1;	/*停止查找*/
	}
	return 0;
}

/**/
uint8_t cb_pic_search( uint32_t addr, TypeDF_PackageHead * phead,void *data )
{
	(*(int*)data)++;
	rt_kprintf("%s>%d\r\n",__func__,*(int*)(data));
	return 0;

}



/*迭代所有记录*/
uint8_t camera_foreach( MYTIME start, MYTIME end, uint8_t chn, uint8_t evt, VisitFunc visit, void *data )
{
	uint32_t			i, addr, addr_next;
	uint8_t				sector;
	TypeDF_PackageHead	pichead;
	uint8_t				ret;

	MYTIME				time_curr;

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * 2 );
	for( sector = 0; sector < CAM_SECTORS; sector++ ) /*就是一个计数器*/
	{
		addr = picinfo_curr.Address;
		sst25_read( addr, (uint8_t*)&pichead, sizeof( TypeDF_PackageHead ) );

		addr_next = addr;
		if( addr == CAM_START )
		{
			addr_next = CAM_END;
		}
		addr_next -= 1024;

		if( strncmp( pichead.Head, CAM_HEAD, strlen( CAM_HEAD ) ) != 0 )
		{
			continue;
		}

		if( ( pichead.State & 0x01 ) == 0 ) ///查看该图片是否被删除
		{
			continue;
		}
		if( ( chn != 0xff ) && ( pichead.Channel_ID != chn ) )
		{
			continue;
		}
		if( ( evt != 0xff ) && ( pichead.TiggerStyle != evt ) )
		{
			continue;
		}
		time_curr = Times_To_LongInt( &pichead.Time );

		if( ( time_curr >= start ) && ( time_curr <= end ) ) ///比较时间是否在范围
		{
			ret = visit( addr,(void*)&pichead,data );
			if( ret )
			{
				break;
			}
		}
	}
	rt_sem_release( &sem_dataflash );
}


/**/
void Cam_Device_init( void )
{
	GPIO_InitTypeDef GPIO_InitStructure;
	///开电
	Power_485CH1_ON;

	///初始化消息队列
	rt_mq_init( &mq_Cam, "mq_cam", &msgpool_cam[0], sizeof( Style_Cam_Requset_Para ), sizeof( msgpool_cam ), RT_IPC_FLAG_FIFO );

	///初始化flash参数
	//Cam_Flash_InitPara( 0 );
	camera_foreach( 0, 0xFFFFFFFF, 0xFF, 0xFF, cb_pic_init,RT_NULL);

	///初始化照相状态参数
	memset( (u8*)&Current_Cam_Para, 0, sizeof( Current_Cam_Para ) );
	Current_Cam_Para.State = CAM_NONE;
}

/************************************** The End Of File **************************************/
